; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-26)
(:domain gripper-strips)
(:objects rooma roomb left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 )
(:init
(room rooma)
(room roomb)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 26
2. (pick ball26 roomb left)
   deleted: (at ball26 roomb) (free left)
   added: (carry ball26 left)
   goals met: 13 of 26
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 13 of 26
4. (drop ball26 rooma left)
   deleted: (carry ball26 left)
   added: (at ball26 rooma) (free left)
   goals met: 14 of 26
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 14 of 26
6. (pick ball25 roomb left)
   deleted: (at ball25 roomb) (free left)
   added: (carry ball25 left)
   goals met: 14 of 26
7. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 14 of 26
8. (drop ball25 rooma left)
   deleted: (carry ball25 left)
   added: (at ball25 rooma) (free left)
   goals met: 15 of 26
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 15 of 26
10. (pick ball24 roomb left)
   deleted: (at ball24 roomb) (free left)
   added: (carry ball24 left)
   goals met: 15 of 26
11. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 15 of 26
12. (drop ball24 rooma left)
   deleted: (carry ball24 left)
   added: (at ball24 rooma) (free left)
   goals met: 16 of 26
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 16 of 26
14. (pick ball23 roomb left)
   deleted: (at ball23 roomb) (free left)
   added: (carry ball23 left)
   goals met: 16 of 26
15. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 16 of 26
16. (drop ball23 rooma left)
   deleted: (carry ball23 left)
   added: (at ball23 rooma) (free left)
   goals met: 17 of 26
17. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 17 of 26
18. (pick ball22 roomb left)
   deleted: (at ball22 roomb) (free left)
   added: (carry ball22 left)
   goals met: 17 of 26
19. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 17 of 26
20. (drop ball22 rooma left)
   deleted: (carry ball22 left)
   added: (at ball22 rooma) (free left)
   goals met: 18 of 26
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 18 of 26
22. (pick ball21 roomb left)
   deleted: (at ball21 roomb) (free left)
   added: (carry ball21 left)
   goals met: 18 of 26
23. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 18 of 26
24. (drop ball21 rooma left)
   deleted: (carry ball21 left)
   added: (at ball21 rooma) (free left)
   goals met: 19 of 26
25. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 19 of 26
26. (pick ball20 roomb left)
   deleted: (at ball20 roomb) (free left)
   added: (carry ball20 left)
   goals met: 19 of 26
27. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 19 of 26
28. (drop ball20 rooma left)
   deleted: (carry ball20 left)
   added: (at ball20 rooma) (free left)
   goals met: 20 of 26
29. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 20 of 26
30. (pick ball19 roomb left)
   deleted: (at ball19 roomb) (free left)
   added: (carry ball19 left)
   goals met: 20 of 26
31. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 20 of 26
32. (drop ball19 rooma left)
   deleted: (carry ball19 left)
   added: (at ball19 rooma) (free left)
   goals met: 21 of 26
33. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 21 of 26
34. (pick ball18 roomb left)
   deleted: (at ball18 roomb) (free left)
   added: (carry ball18 left)
   goals met: 21 of 26
35. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 21 of 26
36. (drop ball18 rooma left)
   deleted: (carry ball18 left)
   added: (at ball18 rooma) (free left)
   goals met: 22 of 26
37. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 26
38. (pick ball17 roomb left)
   deleted: (at ball17 roomb) (free left)
   added: (carry ball17 left)
   goals met: 22 of 26
39. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 22 of 26
40. (drop ball17 rooma left)
   deleted: (carry ball17 left)
   added: (at ball17 rooma) (free left)
   goals met: 23 of 26
41. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 23 of 26
42. (pick ball16 roomb left)
   deleted: (at ball16 roomb) (free left)
   added: (carry ball16 left)
   goals met: 23 of 26
43. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 23 of 26
44. (drop ball16 rooma left)
   deleted: (carry ball16 left)
   added: (at ball16 rooma) (free left)
   goals met: 24 of 26
45. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 26
46. (pick ball15 roomb left)
   deleted: (at ball15 roomb) (free left)
   added: (carry ball15 left)
   goals met: 24 of 26
47. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 26
48. (drop ball15 rooma left)
   deleted: (carry ball15 left)
   added: (at ball15 rooma) (free left)
   goals met: 25 of 26
49. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 25 of 26
50. (pick ball14 roomb left)
   deleted: (at ball14 roomb) (free left)
   added: (carry ball14 left)
   goals met: 25 of 26
51. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 25 of 26
52. (drop ball14 rooma left)
   deleted: (carry ball14 left)
   added: (at ball14 rooma) (free left)
   goals met: 26 of 26
